pongsatorntem/AutoEcar/esp32_display/src/main.cpp
#include <Arduino.h>
#include <SPI.h>
#include <Ethernet.h>
#include <PubSubClient.h>
#include <ArduinoJson.h>
#include <stdarg.h>
#include <string.h>
#include <ESP32-HUB75-MatrixPanel-I2S-DMA.h>
#include <ESP32-VirtualMatrixPanel-I2S-DMA.h>
#include <esp_system.h>
#include "device_config.h"

MatrixPanel_I2S_DMA *matrix = nullptr;
VirtualMatrixPanel *scanMapper = nullptr;
EthernetClient ethClient;
PubSubClient mqtt(ethClient);

String stateText = "BOOT";
String stateColor = "yellow";
String sensorFaultText = "";

unsigned long lastMqttAttempt = 0;
unsigned long lastCommandMs = 0;
unsigned long lastHeartbeatMs = 0;

EthernetLinkStatus lastLinkStatus = Unknown;
bool lastMqttConnected = false;
String lastDrawKey = "";
String loggedTextLayouts = "";
unsigned long lastLineSweepMs = 0;
int lineSweepPhase = 0;
int lineSweepPos = 0;

char commandTopic[96];
char statusTopic[96];

constexpr bool DISPLAY_NUMBER_GRID_TEST = false;
constexpr bool DISPLAY_LINE_SWEEP_TEST = false;
constexpr bool DISPLAY_ROW_TEST = false;
constexpr bool DISPLAY_GEOMETRY_TEST = false;

static constexpr int TEXT_W = PANEL_H;
static constexpr int TEXT_H = PANEL_W;

#if HUB75_SCAN_PROBE == 0
static constexpr int DMA_PANEL_W = PANEL_W;
static constexpr int DMA_PANEL_H = PANEL_H;
#else
static constexpr int DMA_PANEL_W = PANEL_W * 2;
static constexpr int DMA_PANEL_H = PANEL_H / 2;
#endif

void logEvent(const char *category, const char *format, ...) {
  char message[192];
  va_list args;
  va_start(args, format);
  vsnprintf(message, sizeof(message), format, args);
  va_end(args);
  Serial.printf("[%08lu] %-7s | %s\n", millis(), category, message);
}

String ipToString(const IPAddress &ip) {
  char buffer[16];
  snprintf(buffer, sizeof(buffer), "%u.%u.%u.%u", ip[0], ip[1], ip[2], ip[3]);
  return String(buffer);
}

const char *hardwareStatusText(EthernetHardwareStatus status) {
  switch (status) {
    case EthernetNoHardware: return "NO_HARDWARE";
    case EthernetW5100: return "W5100";
    case EthernetW5200: return "W5200";
    case EthernetW5500: return "W5500";
    default: return "UNKNOWN";
  }
}

const char *linkStatusText(EthernetLinkStatus status) {
  switch (status) {
    case Unknown: return "UNKNOWN";
    case LinkON: return "ON";
    case LinkOFF: return "OFF";
    default: return "INVALID";
  }
}

const char *resetReasonText(esp_reset_reason_t reason) {
  switch (reason) {
    case ESP_RST_POWERON: return "POWERON";
    case ESP_RST_EXT: return "EXTERNAL";
    case ESP_RST_SW: return "SOFTWARE";
    case ESP_RST_PANIC: return "PANIC";
    case ESP_RST_INT_WDT: return "INT_WDT";
    case ESP_RST_TASK_WDT: return "TASK_WDT";
    case ESP_RST_WDT: return "WDT";
    case ESP_RST_DEEPSLEEP: return "DEEPSLEEP";
    case ESP_RST_BROWNOUT: return "BROWNOUT";
    case ESP_RST_SDIO: return "SDIO";
    default: return "UNKNOWN";
  }
}

void printBanner() {
  Serial.println();
  Serial.println("================================================");
  Serial.println(" E-CAR TRAFFIC LIGHT DISPLAY");
  Serial.printf(" Firmware : %s\n", FIRMWARE_VERSION);
  Serial.printf(" Display  : %d\n", DISPLAY_ID);
  Serial.println("================================================");
}

const uint8_t GLYPH_A[7] = {0b01110,0b10001,0b10001,0b11111,0b10001,0b10001,0b10001};
const uint8_t GLYPH_C[7] = {0b01110,0b10001,0b10000,0b10000,0b10000,0b10001,0b01110};
const uint8_t GLYPH_E[7] = {0b11111,0b10000,0b10000,0b11110,0b10000,0b10000,0b11111};
const uint8_t GLYPH_I[7] = {0b11111,0b00100,0b00100,0b00100,0b00100,0b00100,0b11111};
const uint8_t GLYPH_K[7] = {0b10001,0b10010,0b10100,0b11000,0b10100,0b10010,0b10001};
const uint8_t GLYPH_L[7] = {0b10000,0b10000,0b10000,0b10000,0b10000,0b10000,0b11111};
const uint8_t GLYPH_N[7] = {0b10001,0b11001,0b10101,0b10011,0b10001,0b10001,0b10001};
const uint8_t GLYPH_O[7] = {0b01110,0b10001,0b10001,0b10001,0b10001,0b10001,0b01110};
const uint8_t GLYPH_P[7] = {0b11110,0b10001,0b10001,0b11110,0b10000,0b10000,0b10000};
const uint8_t GLYPH_R[7] = {0b11110,0b10001,0b10001,0b11110,0b10100,0b10010,0b10001};
const uint8_t GLYPH_S[7] = {0b01111,0b10000,0b10000,0b01110,0b00001,0b00001,0b11110};
const uint8_t GLYPH_T[7] = {0b11111,0b00100,0b00100,0b00100,0b00100,0b00100,0b00100};
const uint8_t GLYPH_U[7] = {0b10001,0b10001,0b10001,0b10001,0b10001,0b10001,0b01110};
const uint8_t GLYPH_1[7] = {0b00100,0b01100,0b00100,0b00100,0b00100,0b00100,0b01110};
const uint8_t GLYPH_2[7] = {0b01110,0b10001,0b00001,0b00010,0b00100,0b01000,0b11111};
const uint8_t GLYPH_3[7] = {0b11110,0b00001,0b00001,0b01110,0b00001,0b00001,0b11110};
const uint8_t GLYPH_4[7] = {0b00010,0b00110,0b01010,0b10010,0b11111,0b00010,0b00010};
const uint8_t GLYPH_COLON[7] = {0b00000,0b00100,0b00100,0b00000,0b00100,0b00100,0b00000};

const uint8_t *getGlyph(char character) {
  switch (character) {
    case 'A': return GLYPH_A;
    case 'C': return GLYPH_C;
    case 'E': return GLYPH_E;
    case 'I': return GLYPH_I;
    case 'K': return GLYPH_K;
    case 'L': return GLYPH_L;
    case 'N': return GLYPH_N;
    case 'O': return GLYPH_O;
    case 'P': return GLYPH_P;
    case 'R': return GLYPH_R;
    case 'S': return GLYPH_S;
    case 'T': return GLYPH_T;
    case 'U': return GLYPH_U;
    case '1': return GLYPH_1;
    case '2': return GLYPH_2;
    case '3': return GLYPH_3;
    case '4': return GLYPH_4;
    case ':': return GLYPH_COLON;
    default: return nullptr;
  }
}

uint16_t displayColor(uint8_t r, uint8_t g, uint8_t b) {
  return matrix->color565(r, g, b);
}

void testDrawPixel(int x, int y, uint16_t color) {
  if (scanMapper) {
    scanMapper->drawPixel(x, y, color);
  } else {
    matrix->drawPixel(x, y, color);
  }
}

void testFillRect(int x, int y, int w, int h, uint16_t color) {
  for (int yy = y; yy < y + h; yy++) {
    for (int xx = x; xx < x + w; xx++) {
      if (xx >= 0 && xx < PANEL_W && yy >= 0 && yy < PANEL_H) {
        testDrawPixel(xx, yy, color);
      }
    }
  }
}

void clearTestScreen(uint16_t color) {
  matrix->fillScreen(color);
}

void drawMappedPixel(int x, int y, uint16_t color) {
  if (x < 0 || x >= TEXT_W || y < 0 || y >= TEXT_H) return;
  matrix->drawPixel(y, x, color);
}

void drawMappedFillRect(int x, int y, int w, int h, uint16_t color) {
  for (int yy = y; yy < y + h; yy++) {
    for (int xx = x; xx < x + w; xx++) {
      drawMappedPixel(xx, yy, color);
    }
  }
}

void drawScaledPixel(int x, int y, uint16_t color, int scale) {
  for (int yOffset = 0; yOffset < scale; yOffset++) {
    int yy = y + yOffset;
    if (yy < 0 || yy >= TEXT_H) continue;
    for (int xOffset = 0; xOffset < scale; xOffset++) {
      int xx = x + xOffset;
      if (xx < 0 || xx >= TEXT_W) continue;
      drawMappedPixel(xx, yy, color);
    }
  }
}

