pongsatorntem/AutoEcar/esp32_display/src/main.cpp
void drawGlyph5x7(int x, int y, char character, uint16_t color, int scale) {
  if (character == ' ') return;
  const uint8_t *glyph = getGlyph(character);
  if (!glyph) return;

  for (int row = 0; row < 7; row++) {
    for (int col = 0; col < 5; col++) {
      if (glyph[row] & (1 << (4 - col))) {
        drawScaledPixel(x + (col * scale), y + (row * scale), color, scale);
      }
    }
  }
}

int textWidth5x7(const char *text, int scale) {
  int length = strlen(text);
  if (length <= 0) return 0;
  return (length * 5 * scale) + ((length - 1) * scale);
}

void drawText5x7(int x, int y, const char *text, uint16_t color, int scale) {
  int cursorX = x;
  while (*text) {
    drawGlyph5x7(cursorX, y, *text, color, scale);
    cursorX += 6 * scale;
    text++;
  }
}

void logTextLayout(const char *text, int x, int y, int width, int height, int scale) {
  String key = "|" + String(text) + ":" + String(x) + ":" + String(y) + ":" + String(scale) + "|";
  if (loggedTextLayouts.indexOf(key) >= 0) return;
  loggedTextLayouts += key;
  logEvent("DISPLAY", "text '%s' x=%d y=%d w=%d h=%d scale=%d", text, x, y, width, height, scale);
}

void drawTrafficTextCentered(const char *text, int y, uint16_t color, int scale) {
  int width = textWidth5x7(text, scale);
  int height = 7 * scale;
  int x = (TEXT_W - width) / 2;
  if (x < 0) x = 0;
  logTextLayout(text, x, y, width, height, scale);
  drawText5x7(x, y, text, color, scale);
}

void drawCautionText(uint16_t color) {
  drawTrafficTextCentered("CA", 0, color, 2);
  drawTrafficTextCentered("UT", 16, color, 2);
  drawTrafficTextCentered("IO", 32, color, 2);
  drawTrafficTextCentered("N", 48, color, 2);
}

void drawStopText(uint16_t color) {
  drawTrafficTextCentered("ST", 16, color, 2);
  drawTrafficTextCentered("OP", 34, color, 2);
}

uint16_t stateBackground(const String &name) {
  if (name == "red") return matrix->color565(255, 0, 0);
  if (name == "yellow") return matrix->color565(255, 210, 0);
  return matrix->color565(0, 210, 0);
}

String effectiveFault() {
  if (!mqtt.connected() || (lastCommandMs && millis() - lastCommandMs > MQTT_COMMAND_TIMEOUT_MS)) return "LINK ERR";
  return sensorFaultText;
}

void drawFaultBadge(const String &fault) {
  if (!fault.length()) return;
  String text = fault;
  if (text.length() > 10) text = text.substring(0, 10);

  drawMappedFillRect(0, 56, TEXT_W, 8, matrix->color565(0, 0, 0));
  drawTrafficTextCentered(text.c_str(), 56, matrix->color565(255, 255, 255), 1);
}

void logDrawAction(const String &fault) {
  String drawKey = stateText + "|" + stateColor + "|" + fault;
  if (drawKey == lastDrawKey) return;
  lastDrawKey = drawKey;

  if (stateColor == "green" || stateText == "GO") {
    logEvent("DISPLAY", "draw GREEN state=%s color=%s", stateText.c_str(), stateColor.c_str());
  } else if (stateColor == "yellow" || stateText == "CAUTION") {
    logEvent("DISPLAY", "draw YELLOW/CAUTION state=%s color=%s", stateText.c_str(), stateColor.c_str());
  } else if (stateColor == "red" || stateText == "STOP") {
    logEvent("DISPLAY", "draw RED/STOP state=%s color=%s", stateText.c_str(), stateColor.c_str());
  } else {
    logEvent("DISPLAY", "draw FALLBACK_CAUTION state=%s color=%s", stateText.c_str(), stateColor.c_str());
  }
  if (fault.length()) logEvent("DISPLAY", "fault overlay=%s", fault.c_str());
}

void drawGeometryDiagonal(int startX, int endX, uint16_t color) {
  for (int y = 0; y < PANEL_H; y++) {
    int x = startX + ((endX - startX) * y) / (PANEL_H - 1);
    if (x >= 0 && x < PANEL_W) testDrawPixel(x, y, color);
  }
}

void drawGeometryTestPattern() {
  static bool logged = false;

  if (!logged) {
    logged = true;
    logEvent("DISPLAY", "DISPLAY_GEOMETRY_TEST active: raw 64x32 primitive pattern");
  }

  uint16_t black = displayColor(0, 0, 0);
  uint16_t white = displayColor(255, 255, 255);
  uint16_t red = displayColor(255, 0, 0);
  uint16_t green = displayColor(0, 255, 0);
  uint16_t blue = displayColor(0, 0, 255);
  uint16_t yellow = displayColor(255, 210, 0);
  uint16_t cyan = displayColor(0, 255, 255);

  clearTestScreen(black);

  testFillRect(0, 0, PANEL_W, 1, white);
  testFillRect(0, PANEL_H - 1, PANEL_W, 1, white);
  testFillRect(0, 0, 1, PANEL_H, white);
  testFillRect(PANEL_W - 1, 0, 1, PANEL_H, white);

  testFillRect(16, 0, 1, PANEL_H, white);
  testFillRect(32, 0, 1, PANEL_H, white);
  testFillRect(48, 0, 1, PANEL_H, white);
  testFillRect(0, 16, PANEL_W, 1, white);

  drawGeometryDiagonal(0, PANEL_W - 1, yellow);
  drawGeometryDiagonal(PANEL_W - 1, 0, cyan);

  testFillRect(4, 4, 6, 6, red);
  testFillRect(54, 4, 6, 6, green);
  testFillRect(4, 22, 6, 6, blue);
  testFillRect(54, 22, 6, 6, white);

  testFillRect(1, 1, 3, 3, red);
  testFillRect(60, 1, 3, 3, green);
  testFillRect(1, 28, 3, 3, blue);
  testFillRect(60, 28, 3, 3, white);
}

uint16_t rowGroupColor(int group) {
  switch (group) {
    case 0: return matrix->color565(255, 0, 0);
    case 1: return matrix->color565(0, 255, 0);
    case 2: return matrix->color565(0, 0, 255);
    case 3: return matrix->color565(255, 255, 0);
    case 4: return matrix->color565(0, 255, 255);
    case 5: return matrix->color565(255, 0, 255);
    case 6: return matrix->color565(255, 128, 0);
    case 7: return matrix->color565(255, 255, 255);
    case 8: return matrix->color565(128, 0, 0);
    case 9: return matrix->color565(0, 128, 0);
    case 10: return matrix->color565(0, 0, 128);
    case 11: return matrix->color565(128, 128, 0);
    case 12: return matrix->color565(0, 128, 128);
    case 13: return matrix->color565(128, 0, 128);
    case 14: return matrix->color565(80, 80, 255);
    default: return matrix->color565(90, 90, 90);
  }
}

void drawRowTestPattern() {
  static bool logged = false;

  if (!logged) {
    logged = true;
    logEvent("DISPLAY", "DISPLAY_ROW_TEST active: 16 row groups, 2 rows each, A/B/C/D markers");
  }

  uint16_t black = matrix->color565(0, 0, 0);
  uint16_t white = matrix->color565(255, 255, 255);

  matrix->fillScreen(black);

