pongsatorntem/AutoEcar/esp32_display/src/main.cpp
  for (int group = 0; group < 16; group++) {
    int y = group * 2;
    uint16_t base = rowGroupColor(group);

    matrix->fillRect(0, y, PANEL_W, 2, base);

    for (int bit = 0; bit < 4; bit++) {
      bool on = (group & (1 << bit)) != 0;
      int x = 2 + (bit * 6);
      matrix->fillRect(x, y, 4, 2, on ? white : black);
    }

    if (group >= 8) {
      matrix->fillRect(58, y, 4, 2, white);
    } else {
      matrix->fillRect(58, y, 4, 2, black);
    }
  }

  matrix->fillRect(0, 0, PANEL_W, 1, white);
  matrix->fillRect(0, PANEL_H - 1, PANEL_W, 1, white);
  matrix->fillRect(0, 0, 1, PANEL_H, white);
  matrix->fillRect(PANEL_W - 1, 0, 1, PANEL_H, white);
}

void drawLineSweepFrame() {
  uint16_t black = displayColor(0, 0, 0);
  uint16_t white = displayColor(255, 255, 255);
  uint16_t green = displayColor(0, 255, 0);
  uint16_t red = displayColor(255, 0, 0);
  uint16_t blue = displayColor(0, 0, 255);
  uint16_t yellow = displayColor(255, 210, 0);

  clearTestScreen(black);
  testFillRect(0, 0, PANEL_W, 1, white);
  testFillRect(0, PANEL_H - 1, PANEL_W, 1, white);
  testFillRect(0, 0, 1, PANEL_H, white);
  testFillRect(PANEL_W - 1, 0, 1, PANEL_H, white);

  testFillRect(2, 2, 4, 4, red);
  testFillRect(PANEL_W - 6, 2, 4, 4, green);
  testFillRect(2, PANEL_H - 6, 4, 4, blue);
  testFillRect(PANEL_W - 6, PANEL_H - 6, 4, 4, yellow);

  if (lineSweepPhase == 0) {
    testFillRect(lineSweepPos, 0, 2, PANEL_H, green);
  } else {
    testFillRect(0, lineSweepPos, PANEL_W, 2, red);
  }
}

void updateLineSweepTest() {
  static bool logged = false;

  if (!logged) {
    logged = true;
    logEvent("DISPLAY", "DISPLAY_LINE_SWEEP_TEST active: vertical x sweep then horizontal y sweep");
  }

  if (millis() - lastLineSweepMs < 90) return;
  lastLineSweepMs = millis();
  drawLineSweepFrame();

  if (lineSweepPhase == 0) {
    lineSweepPos += 2;
    if (lineSweepPos >= PANEL_W) {
      lineSweepPos = 0;
      lineSweepPhase = 1;
      logEvent("DISPLAY", "line sweep phase=HORIZONTAL_Y");
    }
  } else {
    lineSweepPos += 2;
    if (lineSweepPos >= PANEL_H) {
      lineSweepPos = 0;
      lineSweepPhase = 0;
      logEvent("DISPLAY", "line sweep phase=VERTICAL_X");
    }
  }
}

const uint8_t DIGIT_0[5] = {0b111, 0b101, 0b101, 0b101, 0b111};
const uint8_t DIGIT_1[5] = {0b010, 0b110, 0b010, 0b010, 0b111};
const uint8_t DIGIT_2[5] = {0b111, 0b001, 0b111, 0b100, 0b111};
const uint8_t DIGIT_3[5] = {0b111, 0b001, 0b111, 0b001, 0b111};
const uint8_t DIGIT_4[5] = {0b101, 0b101, 0b111, 0b001, 0b001};
const uint8_t DIGIT_5[5] = {0b111, 0b100, 0b111, 0b001, 0b111};
const uint8_t DIGIT_6[5] = {0b111, 0b100, 0b111, 0b101, 0b111};
const uint8_t DIGIT_7[5] = {0b111, 0b001, 0b010, 0b010, 0b010};
const uint8_t DIGIT_8[5] = {0b111, 0b101, 0b111, 0b101, 0b111};
const uint8_t DIGIT_9[5] = {0b111, 0b101, 0b111, 0b001, 0b111};

const uint8_t *getDigitGlyph(char digit) {
  switch (digit) {
    case '0': return DIGIT_0;
    case '1': return DIGIT_1;
    case '2': return DIGIT_2;
    case '3': return DIGIT_3;
    case '4': return DIGIT_4;
    case '5': return DIGIT_5;
    case '6': return DIGIT_6;
    case '7': return DIGIT_7;
    case '8': return DIGIT_8;
    case '9': return DIGIT_9;
    default: return nullptr;
  }
}

void drawDigit3x5(int x, int y, char digit, uint16_t color) {
  const uint8_t *glyph = getDigitGlyph(digit);
  if (!glyph) return;

  for (int row = 0; row < 5; row++) {
    for (int col = 0; col < 3; col++) {
      if (glyph[row] & (1 << (2 - col))) {
        testFillRect(x + col, y + row, 1, 1, color);
      }
    }
  }
}

void drawSmallNumber(int x, int y, int value, uint16_t color) {
  if (value < 10) {
    drawDigit3x5(x + 2, y, char('0' + value), color);
    return;
  }

  drawDigit3x5(x, y, char('0' + (value / 10)), color);
  drawDigit3x5(x + 4, y, char('0' + (value % 10)), color);
}

void drawNumberGridTest() {
  static bool logged = false;

  if (!logged) {
    logged = true;
    logEvent("DISPLAY", "DISPLAY_NUMBER_GRID_TEST active: top row 1-8 bottom row 9-16");
  }

  uint16_t black = displayColor(0, 0, 0);
  uint16_t white = displayColor(255, 255, 255);
  uint16_t yellow = displayColor(255, 210, 0);
  uint16_t red = displayColor(255, 0, 0);
  uint16_t green = displayColor(0, 255, 0);

  clearTestScreen(black);

  for (int x = 0; x <= PANEL_W; x += 8) {
    int lineX = x >= PANEL_W ? PANEL_W - 1 : x;
    testFillRect(lineX, 0, 1, PANEL_H, white);
  }
  testFillRect(0, 0, PANEL_W, 1, white);
  testFillRect(0, 15, PANEL_W, 1, white);
  testFillRect(0, PANEL_H - 1, PANEL_W, 1, white);

  for (int number = 1; number <= 16; number++) {
    int index = number - 1;
    int col = index % 8;
    int row = index / 8;
    int x = col * 8;
    int y = row == 0 ? 5 : 21;
    uint16_t color = number <= 8 ? green : yellow;
    if (number == 1 || number == 9) color = red;
    drawSmallNumber(x, y, number, color);
  }
}

void drawScreen() {
  if (stateColor == "red" || stateText == "STOP") {
    matrix->fillScreen(
      matrix->color565(255, 0, 0)
    );
    return;
  }

  if (stateColor == "yellow" || stateText == "CAUTION") {
    matrix->fillScreen(
      matrix->color565(255, 210, 0)
    );
    return;
  }

  // GREEN / default
  matrix->fillScreen(
    matrix->color565(0, 210, 0)
  );
}

void callback(char *topic, byte *payload, unsigned int length) {
  logEvent("MQTT", "RX topic=%s bytes=%u", topic, length);

  JsonDocument doc;
  DeserializationError error = deserializeJson(doc, payload, length);
  if (error) {
    logEvent("MQTT", "JSON parse_error=%s", error.c_str());
    return;
  }

  String previousText = stateText;
  String previousColor = stateColor;
  String previousFault = sensorFaultText;

  stateText = String((const char *)(doc["text"] | "GO"));
  stateColor = String((const char *)(doc["color"] | "green"));
  sensorFaultText = String((const char *)(doc["fault_text"] | ""));
  lastCommandMs = millis();

  logEvent(
    "MQTT",
    "parsed state=%s text=%s color=%s fault_text=%s",
    (const char *)(doc["state"] | ""),
    stateText.c_str(),
    stateColor.c_str(),
    sensorFaultText.c_str()
  );

