pongsatorntem/AutoEcar/esp32_display/src/main.cpp
  if (stateText != previousText || stateColor != previousColor || sensorFaultText != previousFault) {
    logEvent("STATE", "changed text=%s color=%s fault=%s", stateText.c_str(), stateColor.c_str(), sensorFaultText.c_str());
  }

  drawScreen();
}

void connectMqtt() {
  if (mqtt.connected() || millis() - lastMqttAttempt < 2000) return;
  lastMqttAttempt = millis();

  char clientId[32];
  snprintf(clientId, sizeof(clientId), "display-%d", DISPLAY_ID);
  logEvent("MQTT", "connecting client=%s broker=%s:%u", clientId, ipToString(MQTT_IP).c_str(), MQTT_PORT);

  if (mqtt.connect(clientId, statusTopic, 1, true, "offline")) {
    logEvent("MQTT", "connected");
    bool published = mqtt.publish(statusTopic, "online", true);
    logEvent("MQTT", "status publish topic=%s result=%s", statusTopic, published ? "OK" : "FAIL");
    bool subscribed = mqtt.subscribe(commandTopic, 1);
    logEvent("MQTT", "subscribed topic=%s result=%s", commandTopic, subscribed ? "OK" : "FAIL");
  } else {
    logEvent("MQTT", "connect_failed state=%d", mqtt.state());
  }

  drawScreen();
}

void logNetworkStatus(const char *category) {
  logEvent(category, "hardware=%s", hardwareStatusText(Ethernet.hardwareStatus()));
  logEvent(category, "link=%s", linkStatusText(Ethernet.linkStatus()));
  logEvent(category, "IP=%s", ipToString(Ethernet.localIP()).c_str());
  logEvent(category, "subnet=%s", ipToString(Ethernet.subnetMask()).c_str());
  logEvent(category, "gateway=%s", ipToString(Ethernet.gatewayIP()).c_str());
}

void logHeartbeat() {
  if (millis() - lastHeartbeatMs < 5000) return;
  lastHeartbeatMs = millis();
  logEvent(
    "HEART",
    "ETH=%s LINK=%s IP=%s MQTT=%s STATE=%s/%s heap=%u",
    hardwareStatusText(Ethernet.hardwareStatus()),
    linkStatusText(Ethernet.linkStatus()),
    ipToString(Ethernet.localIP()).c_str(),
    mqtt.connected() ? "ON" : "OFF",
    stateText.c_str(),
    stateColor.c_str(),
    ESP.getFreeHeap()
  );
}

void checkNetworkTransitions() {
  EthernetLinkStatus link = Ethernet.linkStatus();
  if (link != lastLinkStatus) {
    logEvent("ETH", "link_change %s -> %s", linkStatusText(lastLinkStatus), linkStatusText(link));
    lastLinkStatus = link;
    drawScreen();
  }

  bool connected = mqtt.connected();
  if (connected != lastMqttConnected) {
    logEvent("MQTT", "connection_change %s", connected ? "CONNECTED" : "DISCONNECTED");
    if (!connected) logEvent("MQTT", "disconnect_state=%d", mqtt.state());
    lastMqttConnected = connected;
    drawScreen();
  }
}

void setup() {
  Serial.begin(115200);
  delay(200);

  printBanner();
  logEvent("BOOT", "setup START");
  logEvent("BOOT", "reset=%s", resetReasonText(esp_reset_reason()));
  logEvent("BOOT", "free_heap=%u flash=%u psram=%u", ESP.getFreeHeap(), ESP.getFlashChipSize(), ESP.getPsramSize());

  snprintf(commandTopic, sizeof(commandTopic), "factory/trafficlight/junction/1/display");
  snprintf(statusTopic, sizeof(statusTopic), "factory/trafficlight/junction/1/display/%d/status", DISPLAY_ID);

  logEvent("CONFIG", "DISPLAY_ID=%d", DISPLAY_ID);
  logEvent("CONFIG", "IP=%s", ipToString(DEVICE_IP).c_str());
  logEvent("CONFIG", "MQTT=%s:%u", ipToString(MQTT_IP).c_str(), MQTT_PORT);
  logEvent("CONFIG", "command_topic=%s", commandTopic);
  logEvent("CONFIG", "status_topic=%s", statusTopic);

  HUB75_I2S_CFG::i2s_pins hub75Pins = {
    42, 41, 40,
    39, 38, 37,
    48, 36, 45, HUB75_D_PIN, -1,
    47, 14, 2
  };

  logEvent("HUB75", "pins A=48 B=36 C=45 D=%d E=-1 LAT=47 OE=14 CLK=2", HUB75_D_PIN);

  HUB75_I2S_CFG mxconfig(DMA_PANEL_W, DMA_PANEL_H, PANEL_CHAIN, hub75Pins);
  logEvent("HUB75", "dma_config width=%d height=%d scan_probe=%d", DMA_PANEL_W, DMA_PANEL_H, HUB75_SCAN_PROBE);
  logEvent("HUB75", "init START");
  matrix = new MatrixPanel_I2S_DMA(mxconfig);
  matrix->begin();
  matrix->setBrightness8(MATRIX_BRIGHTNESS);

#if HUB75_SCAN_PROBE != 0
  scanMapper = new VirtualMatrixPanel(*matrix, 1, 1, PANEL_W, PANEL_H, CHAIN_NONE);
#if HUB75_SCAN_PROBE == 32
  scanMapper->setPhysicalPanelScanRate(FOUR_SCAN_32PX_HIGH, HUB75_SCAN_PIXEL_BASE);
#elif HUB75_SCAN_PROBE == 16
  scanMapper->setPhysicalPanelScanRate(FOUR_SCAN_16PX_HIGH, HUB75_SCAN_PIXEL_BASE);
#elif HUB75_SCAN_PROBE == 64
  scanMapper->setPhysicalPanelScanRate(FOUR_SCAN_64PX_HIGH, HUB75_SCAN_PIXEL_BASE);
#elif HUB75_SCAN_PROBE == 40
  scanMapper->setPhysicalPanelScanRate(FOUR_SCAN_40PX_HIGH, HUB75_SCAN_PIXEL_BASE);
#endif
  logEvent("HUB75", "virtual_scan probe=%d pixel_base=%d", HUB75_SCAN_PROBE, HUB75_SCAN_PIXEL_BASE);
#endif

  logEvent("HUB75", "init DONE brightness=%u", MATRIX_BRIGHTNESS);
  drawScreen();

  logEvent("SPI", "begin START");
  logEvent("SPI", "SCK=%u MISO=%u MOSI=%u CS=%u RST=%u", W5500_SCK, W5500_MISO, W5500_MOSI, W5500_CS, W5500_RST);

  logEvent("ETH", "W5500 reset START");
  pinMode(W5500_RST, OUTPUT);
  digitalWrite(W5500_RST, LOW);
  delay(10);
  digitalWrite(W5500_RST, HIGH);
  delay(200);
  logEvent("ETH", "W5500 reset DONE");

  SPI.begin(W5500_SCK, W5500_MISO, W5500_MOSI, W5500_CS);
  delay(100);
  logEvent("SPI", "begin DONE");

  logEvent("ETH", "Ethernet.init START");
  Ethernet.init(W5500_CS);
  logEvent("ETH", "Ethernet.init DONE");

  byte mac[] = {0x02, 0x54, 0x4C, 0x00, 0x00, (byte)DISPLAY_ID};
  logEvent("ETH", "MAC=%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
  logEvent("ETH", "Ethernet.begin START");
  Ethernet.begin(mac, DEVICE_IP, DNS_IP, GATEWAY_IP, SUBNET_MASK);
  logEvent("ETH", "Ethernet.begin DONE");
  logNetworkStatus("ETH");
  lastLinkStatus = Ethernet.linkStatus();

  logEvent("MQTT", "broker=%s:%u", ipToString(MQTT_IP).c_str(), MQTT_PORT);
  mqtt.setServer(MQTT_IP, MQTT_PORT);
  mqtt.setCallback(callback);
  mqtt.setBufferSize(512);
  logEvent("MQTT", "buffer_size=512");
  logEvent("BOOT", "setup DONE");
}

void loop() {
  connectMqtt();
  mqtt.loop();
  checkNetworkTransitions();
  logHeartbeat();

  if (DISPLAY_LINE_SWEEP_TEST) {
    updateLineSweepTest();
    return;
  }

  static unsigned long lastDraw = 0;
  if (millis() - lastDraw > 500) {
    lastDraw = millis();
    drawScreen();
  }
}
